Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetMultiDirectoryFileList Method
Overload List
Name | Description
GetMultiDirectoryFileList(String)
 Gets a list of files with the given extension from the default search directories.
GetMultiDirectoryFileList(List<String>, String)
 Gets a list of files with the given extension from the given search directories and from XS_FIRM, XS_PROJECT subdirectories.
Top
See Also
Reference
EnvironmentFiles Class
Tekla.Structures.Dialog.UIControls Namespace